UTAF_Base/requestFiles/PTS_FindPerson.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:v2="http://api.web.bc/api/schema/commoncontext/v2" xmlns:v1="http://api.web.bc/api/schema/commoncontext/transaction/v1"
	xmlns:v11="http://api.web.bc/api/schema/commoncontext/consumertransaction/v1"
	xmlns:v4="http://api.web.bc/capability/business/b182/services/person/v4"
	xmlns:v41="http://api.web.bc/capability/business/b182/objects/requestfindperson/v4">
	<soapenv:Header>
		<v2:CommonContextRequest>
			<v2:transaction>
				<v1:messageId>${Req_corrId}</v1:messageId>
				<v1:conversationId>${Req_conversationId}</v1:conversationId>
				<v1:dateTimeCreated>${Req_dateTimeCreated}</v1:dateTimeCreated>
			</v2:transaction>
		</v2:CommonContextRequest>
	</soapenv:Header>
	<soapenv:Body>
		<v4:RequestDataFindPerson version="1.0">
			<v4:serviceContext>
				<v4:nameFindMethod>
					<v41:value>${Req_nameFindMethod}</v41:value>
				</v4:nameFindMethod>
				<v4:transactionData>
					<v4:endUserId>${Req_endUserId}</v4:endUserId>
					<v4:endUserLanguage>EN</v4:endUserLanguage>
					<v4:consumerApplication>CDB</v4:consumerApplication>
				</v4:transactionData>
			</v4:serviceContext>
			<v4:serviceData>
				<v4:criteria>
					<v4:personName>
						<v41:firstName>${Req_firstName}</v41:firstName>
						<v41:preferredFirstName>${Req_preferredFirstName}</v41:preferredFirstName>
						<v41:lastName>${Req_lastName}</v41:lastName>
					</v4:personName>
					<v4:birthDate>${Req_birthDate}</v4:birthDate>
					<v4:mobileId>
						<v41:identifier>${Req_mobileId}</v41:identifier>
					</v4:mobileId>
					<v4:wegenerIdentifier>${Req_wegenerIdentifier}</v4:wegenerIdentifier>
				</v4:criteria>
			</v4:serviceData>
		</v4:RequestDataFindPerson>
	</soapenv:Body>
</soapenv:Envelope>
